local function run(msg)
if msg.text == "همیار" then
  return "بفرمایید"
end
if msg.text == "همیار گروه" then
  return "جانم"  
end
if msg.text == "چه خبر" then
  return "سلامتی"  
end
if msg.text == "خوبی؟" then
  return "بد نیستم"  
end
if msg.text == "همیار چیه" then
  return "بهترین اراعه دهنده گروه های ضد اسپمه مثل این گروهی که الان هستی اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "این ربات چی هست" then
  return "بهترین اراعه دهنده گروه های ضد اسپمه مثل این گروهی که الان هستی اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "رباته؟" then
  return "بهترین اراعه دهنده گروه های ضد اسپمه مثل این گروهی که الان هستی اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "چجوریه این گروه؟" then
  return "بهترین اراعه دهنده گروه های ضد اسپمه مثل این گروهی که الان هستی اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "چجوری میشه اینجور گروه ها ساخت؟" then
  return "بهترین اراعه دهنده گروه های ضد اسپمه مثل این گروهی که الان هستی اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "bye" then
  return "بای ❤️"  
end
if msg.text == "من ازین گروه ها میخوام" then
  return " اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "چجوری گروه اینجوری ساختین؟" then
  return " اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "خوش اومدی " then
  return "به گروه خوش اومدی"  
end
if msg.text == "به منم گروه بدین" then
  return " اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "گروه ضد اسپم میخوام" then
  return " اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "گروه با امنیت بالا میخوام" then
  return " اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "این گروه عالیه" then
  return " اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "کی اینجا بلده از این گروه ها بسازه" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه از کجا بخرم؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "اسپم" then
  return "⛔️در صورت مشاهده اسپم شما حذف خواهید شد."  
end
if msg.text == "گروه از کجا گرفتید؟" then
  return " اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "گروه ضد اسپم بدید" then
  return " اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "کی سازنده اینجور گروهاست" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "گروه میخرم" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "ضد اسپم یعنی چی؟" then
  return "نمیدونی یعنی چی ؟؟؟ 😳 برو تو این سایت  https://hg.hamyartec.ir هم میتونی اطلاعات جمع کنی درباره گروه های ضد اسپم هم میتونی برای خودت به آسانی یدونه تهیه کنی 😊"  
end
if msg.text == "سوپر گروه میخوام" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "/start" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "کسی اینجا گروه میفروشه؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"  
end
if msg.text == "میتونین بگین گروه از کجا بخرم؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "این گروه حرف نداره" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "بای" then
  return "بای عزیزم "
end
if msg.text == "راهنمایی کنید چجور گروه بسازم" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "چه گروه امنی" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "چه گروه خوبی" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه بسازین برام" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "چه امکاناتی داره اینجا" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "همچین گروهی ندیدم جایی" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "میتونم منم از این گروه ها داشته باشم؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "ربات تو گروه منم بیارید" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "چجور بیارمش گروه خودم ربات" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "چجور بیارمش گروه خودم رباتو" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "چجور بیارمش گروه خودم ربات؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "چجور بیارمش گروه خودم رباتو؟؟؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "میشه بیارینش تو گروه من رباتو؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "میشه ربات بیارینش گروه من؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "میشه ربات بیارینش گروه من؟؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "چه گروه عجیب غریبی" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "به منم یاد بدید چجور میسازین این گروه هارو" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "به منم یاد بدید چجور میسازین اینجور گروه هارو" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه از کجا خریدی؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه چجور اینجوریش کردی؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه منم اینجوری میکنید؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "میشه گروه منم اینجوری کنید؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "میشه گروه منم اینجوری کنید" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "منم میخوام گروهم ضد اسپم باشه" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه ضد اسپم یعنی چی؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "ربات ضد اسپم یعنی چی؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "کسی اینجا گروه ضد اسپم میروشه؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه های جدید چه خوب شده" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "جدیدا گروه ها خوب شده" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه خوب میخوام" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه میدید؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه منم ضد اسپم کنید" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "تو گروه منم از این ربات ها بزارید" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه جالبی" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "ربات جالبی" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "فروشنده گروه کیه؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "یه گروه رایگانم به من میدید؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
if msg.text == "گروه رایگان میدید؟" then
  return "اگر دوست داری توام یکی از گروه های پیشرفته داشته باشی به سایت رسمی همیار گروه در این آدرسhttps://hg.hamyartec.ir مراجعه کن  😊"
end
end

return {
  description = "Chat With Robot Server", 
  usage = "chat with robot",
  patterns = {
    "^همیار$",
    "^همیار گروه$",
    "^چه خبر$",
    "^خوبی؟$",
    "^همیار چیه$",
    "^این ربات چی هست",
    "^رباته؟$",
    "^چجوریه این گروه؟$",
    "^چجوری میشه اینجور گروه ها ساخت؟$",
    "^bye$",
    "^من ازین گروه ها میخوام$",
    "^خوش اومدی$",
    "^چجوری گروه اینجوری ساختین؟$",
    "^خوش اومدی$",
    "^به منم گروه بدین$",
    "^گروه ضد اسپم میخوام$",
    "^گروه با امنیت بالا میخوام$",
    "^کی اینجا بلده از این گروه ها بسازه$",
    "^این گروه عالیه$",
    "^گروه از کجا بخرم؟$",
    "^اسپم$",
    "^گروه از کجا گرفتید؟$",
    "^گروه ضد اسپم بدید$",
    "^کی سازنده اینجور گروهاست$",
    "^گروه میخرم$",
    "^ضد اسپم یعنی چی؟$",
    "^سوپر گروه میخوام$",
    "^/start$",
    "^کسی اینجا گروه میفروشه؟$",
    "^بای$",
    "^کص ننت$",
    "^همیار گروه$"
	"^میتونین بگین گروه از کجا بخرم؟$",
	"^این گروه حرف نداره$",
	"^راهنمایی کنید چجور گروه بسازم$",
	"^چه گروه امنی$",
	"^چه گروه خوبی$",
	"^گروه بسازین برام$",
	"^چه امکاناتی داره اینجا$",
	"^همچین گروهی ندیدم جایی$",
	"^میتونم منم از این گروه ها داشته باشم؟$",
	"^ربات تو گروه منم بیارید$",
	"^چجور بیارمش گروه خودم ربات$",
	"^چجور بیارمش گروه خودم رباتو$",
	"^چجور بیارمش گروه خودم ربات؟$",
	"^چجور بیارمش گروه خودم رباتو؟؟؟$",
	"^میشه بیارینش تو گروه من رباتو؟$",
	"^میشه ربات بیارینش گروه من؟$",
	"^میشه ربات بیارینش گروه من؟؟$",
	"^چه گروه عجیب غریبی$",
	"^به منم یاد بدید چجور میسازین این گروه هارو$",
	"^گروه از کجا خریدی؟$",
	"^گروه چجور اینجوریش کردی؟$",
	"^گروه منم اینجوری میکنید؟$",
	"^میشه گروه منم اینجوری کنید؟$",
	"^منم میخوام گروهم ضد اسپم باشه$",
	"^گروه ضد اسپم یعنی چی؟$",
	"^ربات ضد اسپم یعنی چی؟$",
	"^کسی اینجا گروه ضد اسپم میروشه؟$",
	"^گروه های جدید چه خوب شده$",
	"^جدیدا گروه ها خوب شده$",
	"^گروه خوب میخوام$",
	"^گروه میدید؟$",
	"^گروه منم ضد اسپم کنید$",
	"^تو گروه منم از این ربات ها بزارید$",
	"^گروه جالبی$",
	"^ربات جالبی$",
	"^فروشنده گروه کیه؟$",
	"^یه گروه رایگانم به من میدید؟$",
	"^گروه رایگان میدید؟$",
    }, 
  run = run,
    —privileged = true,
  pre_process = pre_process
}
